calm water resistance/KCS/Fr0.1516/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.617875372698828 0 -8.291651997119082)
	(21.92681305904824 0 -8.291651997119082)
	(21.92681305904824 9.212946663465647 -8.291651997119082)
	(-14.617875372698828 9.212946663465647 -8.291651997119082)
	(-14.617875372698828 0 3.6851786653862586)
	(21.92681305904824 0 3.6851786653862586)
	(21.92681305904824 9.212946663465647 3.6851786653862586)
	(-14.617875372698828 9.212946663465647 3.6851786653862586)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (119 30 39) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

