calm water resistance/KCS/Fr0.1516/0.org/include/initialConditions
flowVelocity          (1.281025 0 0);
Umean                  1.281025;
turbulentKE            2.461538e-04;
turbulentOmega         8.799941e-01;
turbulentEpsilon       1.299683e-07;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;